In [1]:
import pandas as pd

In [5]:
exeam_data={'수학':[90,80,70],
            '영어':[98,89,95],
           '음악':[85,95,100],
            '체육':[100,90,90]}
df=pd.DataFrame(exeam_data,index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [3]:
df=pd.DataFrame(exeam_data,index=['서준','우현','인아'])

In [14]:
#행 인덱스 인덱스를 행을선택할때
rlabe1=df.loc["서준"]

In [11]:
#행인덱스  정수형 인덱스를 선택할때
positon1=df.iloc[0]
positon1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [17]:
rlabe2=df.loc["우현":]
rlabe2

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [19]:
rlabe2=df.loc["우현":]

In [21]:
df.loc[:"우현"] #처음부터 우현까지

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [22]:
df.loc["우현":] #우현부터 끝까지

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [23]:
df.loc[:] #처음부터 끝까지

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [24]:
df.iloc[:2] #처음부터 우현까지(3이전 1번)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [25]:
df.iloc[1:]  #우현부터 끝까지

    수학  영어   음악  체육
우현  80  89   95  90
인아  70  95  100  90

In [26]:
df.iloc[:] # 처음부터 끝까지

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90